wowHollis/SmartCart/src/camera/pixy/misc/gcc/m0/Release/cr_startup_lpc43xx-m0app.asm
   1              		.syntax unified
   2              		.cpu cortex-m0
   3              		.fpu softvfp
   4              		.eabi_attribute 20, 1
   5              		.eabi_attribute 21, 1
   6              		.eabi_attribute 23, 3
   7              		.eabi_attribute 24, 1
   8              		.eabi_attribute 25, 1
   9              		.eabi_attribute 26, 1
  10              		.eabi_attribute 30, 6
  11              		.eabi_attribute 34, 0
  12              		.eabi_attribute 18, 4
  13              		.thumb
  14              		.syntax unified
  15              		.file	"cr_startup_lpc43xx-m0app.c"
  16              		.text
  17              	.Ltext0:
  18              		.cfi_sections	.debug_frame
  19              		.global	g_pfnVectors
  20              		.section	.isr_vector,"a",%progbits
  21              		.align	2
  24              	g_pfnVectors:
  25 0000 00000000 		.word	_vStackTop
  26 0004 00000000 		.word	ResetISR
  27 0008 00000000 		.word	M0_NMI_Handler
  28 000c 00000000 		.word	M0_HardFault_Handler
  29 0010 00000000 		.word	0
  30 0014 00000000 		.word	0
  31 0018 00000000 		.word	0
  32 001c 00000000 		.word	0
  33 0020 00000000 		.word	0
  34 0024 00000000 		.word	0
  35 0028 00000000 		.word	0
  36 002c 00000000 		.word	M0_SVC_Handler
  37 0030 00000000 		.word	0
  38 0034 00000000 		.word	0
  39 0038 00000000 		.word	M0_PendSV_Handler
  40 003c 00000000 		.word	M0_SysTick_Handler
  41 0040 00000000 		.word	M0_RTC_IRQHandler
  42 0044 00000000 		.word	M0_M4CORE_IRQHandler
  43 0048 00000000 		.word	M0_DMA_IRQHandler
  44 004c 00000000 		.word	0
  45 0050 00000000 		.word	0
  46 0054 00000000 		.word	M0_ETH_IRQHandler
  47 0058 00000000 		.word	M0_SDIO_IRQHandler
  48 005c 00000000 		.word	M0_LCD_IRQHandler
  49 0060 00000000 		.word	M0_USB0_IRQHandler
  50 0064 00000000 		.word	M0_USB1_IRQHandler
  51 0068 00000000 		.word	M0_SCT_IRQHandler
  52 006c 00000000 		.word	M0_RIT_OR_WWDT_IRQHandler
  53 0070 00000000 		.word	M0_TIMER0_IRQHandler
  54 0074 00000000 		.word	M0_GINT1_IRQHandler
  55 0078 00000000 		.word	M0_TIMER3_IRQHandler
  56 007c 00000000 		.word	0
  57 0080 00000000 		.word	0
  58 0084 00000000 		.word	M0_MCPWM_IRQHandler
  59 0088 00000000 		.word	M0_ADC0_IRQHandler
  60 008c 00000000 		.word	M0_I2C0_OR_I2C1_IRQHandler
  61 0090 00000000 		.word	M0_SGPIO_IRQHandler
  62 0094 00000000 		.word	M0_SPI_OR_DAC_IRQHandler
  63 0098 00000000 		.word	M0_ADC1_IRQHandler
  64 009c 00000000 		.word	M0_SSP0_OR_SSP1_IRQHandler
  65 00a0 00000000 		.word	M0_EVENTROUTER_IRQHandler
  66 00a4 00000000 		.word	M0_USART0_IRQHandler
  67 00a8 00000000 		.word	M0_USART2_OR_C_CAN1_IRQHandler
  68 00ac 00000000 		.word	M0_USART3_IRQHandler
  69 00b0 00000000 		.word	M0_I2S0_OR_I2S1_OR_QEI_IRQHandler
  70 00b4 00000000 		.word	M0_C_CAN0_IRQHandler
  71 00b8 00000000 		.word	M0_SPIFI_OR_VADC_IRQHandler
  72 00bc 00000000 		.word	M0_M0SUB_IRQHandler
  73              		.section	.after_vectors,"ax",%progbits
  74              		.align	2
  75              		.global	data_init
  76              		.code	16
  77              		.thumb_func
  79              	data_init:
  80              	.LFB32:
  81              		.file 1 "../src/cr_startup_lpc43xx-m0app.c"
   1:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
   2:../src/cr_startup_lpc43xx-m0app.c **** // LPC43xx (Cortex M0 APP) Startup code for use with LPCXpresso IDE
   3:../src/cr_startup_lpc43xx-m0app.c **** //
   4:../src/cr_startup_lpc43xx-m0app.c **** // Version : 140113
   5:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
   6:../src/cr_startup_lpc43xx-m0app.c **** //
   7:../src/cr_startup_lpc43xx-m0app.c **** // Copyright(C) NXP Semiconductors, 2013-2014
   8:../src/cr_startup_lpc43xx-m0app.c **** // All rights reserved.
   9:../src/cr_startup_lpc43xx-m0app.c **** //
  10:../src/cr_startup_lpc43xx-m0app.c **** // Software that is described herein is for illustrative purposes only
  11:../src/cr_startup_lpc43xx-m0app.c **** // which provides customers with programming information regarding the
  12:../src/cr_startup_lpc43xx-m0app.c **** // LPC products.  This software is supplied "AS IS" without any warranties of
  13:../src/cr_startup_lpc43xx-m0app.c **** // any kind, and NXP Semiconductors and its licensor disclaim any and
  14:../src/cr_startup_lpc43xx-m0app.c **** // all warranties, express or implied, including all implied warranties of
  15:../src/cr_startup_lpc43xx-m0app.c **** // merchantability, fitness for a particular purpose and non-infringement of
  16:../src/cr_startup_lpc43xx-m0app.c **** // intellectual property rights.  NXP Semiconductors assumes no responsibility
  17:../src/cr_startup_lpc43xx-m0app.c **** // or liability for the use of the software, conveys no license or rights under any
  18:../src/cr_startup_lpc43xx-m0app.c **** // patent, copyright, mask work right, or any other intellectual property rights in
  19:../src/cr_startup_lpc43xx-m0app.c **** // or to any products. NXP Semiconductors reserves the right to make changes
  20:../src/cr_startup_lpc43xx-m0app.c **** // in the software without notification. NXP Semiconductors also makes no
  21:../src/cr_startup_lpc43xx-m0app.c **** // representation or warranty that such application will be suitable for the
  22:../src/cr_startup_lpc43xx-m0app.c **** // specified use without further testing or modification.
  23:../src/cr_startup_lpc43xx-m0app.c **** //
  24:../src/cr_startup_lpc43xx-m0app.c **** // Permission to use, copy, modify, and distribute this software and its
  25:../src/cr_startup_lpc43xx-m0app.c **** // documentation is hereby granted, under NXP Semiconductors' and its
  26:../src/cr_startup_lpc43xx-m0app.c **** // licensor's relevant copyrights in the software, without fee, provided that it
  27:../src/cr_startup_lpc43xx-m0app.c **** // is used in conjunction with NXP Semiconductors microcontrollers.  This
  28:../src/cr_startup_lpc43xx-m0app.c **** // copyright, permission, and disclaimer notice must appear in all copies of
  29:../src/cr_startup_lpc43xx-m0app.c **** // this code.
  30:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  31:../src/cr_startup_lpc43xx-m0app.c **** 
  32:../src/cr_startup_lpc43xx-m0app.c **** #include "debug_frmwrk.h"
  33:../src/cr_startup_lpc43xx-m0app.c **** 
  34:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__cplusplus)
  35:../src/cr_startup_lpc43xx-m0app.c **** #ifdef __REDLIB__
  36:../src/cr_startup_lpc43xx-m0app.c **** #error Redlib does not support C++
  37:../src/cr_startup_lpc43xx-m0app.c **** #else
  38:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  39:../src/cr_startup_lpc43xx-m0app.c **** //
  40:../src/cr_startup_lpc43xx-m0app.c **** // The entry point for the C++ library startup
  41:../src/cr_startup_lpc43xx-m0app.c **** //
  42:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  43:../src/cr_startup_lpc43xx-m0app.c **** extern "C" {
  44:../src/cr_startup_lpc43xx-m0app.c ****   extern void __libc_init_array(void);
  45:../src/cr_startup_lpc43xx-m0app.c **** }
  46:../src/cr_startup_lpc43xx-m0app.c **** #endif
  47:../src/cr_startup_lpc43xx-m0app.c **** #endif
  48:../src/cr_startup_lpc43xx-m0app.c **** 
  49:../src/cr_startup_lpc43xx-m0app.c **** #define WEAK __attribute__ ((weak))
  50:../src/cr_startup_lpc43xx-m0app.c **** #define ALIAS(f) __attribute__ ((weak, alias (#f)))
  51:../src/cr_startup_lpc43xx-m0app.c **** 
  52:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  53:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__cplusplus)
  54:../src/cr_startup_lpc43xx-m0app.c **** extern "C" {
  55:../src/cr_startup_lpc43xx-m0app.c **** #endif
  56:../src/cr_startup_lpc43xx-m0app.c **** 
  57:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  58:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_CMSIS) || defined (__USE_LPCOPEN)
  59:../src/cr_startup_lpc43xx-m0app.c **** // Declaration of external SystemInit function
  60:../src/cr_startup_lpc43xx-m0app.c **** extern void SystemInit(void);
  61:../src/cr_startup_lpc43xx-m0app.c **** #endif
  62:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  63:../src/cr_startup_lpc43xx-m0app.c **** //
  64:../src/cr_startup_lpc43xx-m0app.c **** // Forward declaration of the default handlers. These are aliased.
  65:../src/cr_startup_lpc43xx-m0app.c **** // When the application defines a handler (with the same name), this will 
  66:../src/cr_startup_lpc43xx-m0app.c **** // automatically take precedence over these weak definitions
  67:../src/cr_startup_lpc43xx-m0app.c **** //
  68:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  69:../src/cr_startup_lpc43xx-m0app.c ****      void ResetISR(void);
  70:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
  71:../src/cr_startup_lpc43xx-m0app.c **** WEAK void NMI_Handler(void);
  72:../src/cr_startup_lpc43xx-m0app.c **** WEAK void HardFault_Handler(void);
  73:../src/cr_startup_lpc43xx-m0app.c **** WEAK void SVC_Handler(void);
  74:../src/cr_startup_lpc43xx-m0app.c **** WEAK void PendSV_Handler(void);
  75:../src/cr_startup_lpc43xx-m0app.c **** WEAK void SysTick_Handler(void);
  76:../src/cr_startup_lpc43xx-m0app.c **** WEAK void IntDefaultHandler(void);
  77:../src/cr_startup_lpc43xx-m0app.c **** #else
  78:../src/cr_startup_lpc43xx-m0app.c **** WEAK void M0_NMI_Handler(void);
  79:../src/cr_startup_lpc43xx-m0app.c **** WEAK void M0_HardFault_Handler (void);
  80:../src/cr_startup_lpc43xx-m0app.c **** WEAK void M0_SVC_Handler(void);
  81:../src/cr_startup_lpc43xx-m0app.c **** WEAK void M0_PendSV_Handler(void);
  82:../src/cr_startup_lpc43xx-m0app.c **** WEAK void M0_SysTick_Handler(void);
  83:../src/cr_startup_lpc43xx-m0app.c **** WEAK void M0_IntDefaultHandler(void);
  84:../src/cr_startup_lpc43xx-m0app.c **** #endif
  85:../src/cr_startup_lpc43xx-m0app.c **** 
  86:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  87:../src/cr_startup_lpc43xx-m0app.c **** //
  88:../src/cr_startup_lpc43xx-m0app.c **** // Forward declaration of the specific IRQ handlers. These are aliased
  89:../src/cr_startup_lpc43xx-m0app.c **** // to the IntDefaultHandler, which is a 'forever' loop. When the application
  90:../src/cr_startup_lpc43xx-m0app.c **** // defines a handler (with the same name), this will automatically take 
  91:../src/cr_startup_lpc43xx-m0app.c **** // precedence over these weak definitions
  92:../src/cr_startup_lpc43xx-m0app.c **** //
  93:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
  94:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
  95:../src/cr_startup_lpc43xx-m0app.c **** void RTC_IRQHandler(void) ALIAS(IntDefaultHandler);
  96:../src/cr_startup_lpc43xx-m0app.c **** void MX_CORE_IRQHandler(void) ALIAS(IntDefaultHandler);
  97:../src/cr_startup_lpc43xx-m0app.c **** void DMA_IRQHandler(void) ALIAS(IntDefaultHandler);
  98:../src/cr_startup_lpc43xx-m0app.c **** void FLASHEEPROM_IRQHandler(void) ALIAS(IntDefaultHandler);
  99:../src/cr_startup_lpc43xx-m0app.c **** void ETH_IRQHandler(void) ALIAS(IntDefaultHandler);
 100:../src/cr_startup_lpc43xx-m0app.c **** void SDIO_IRQHandler(void) ALIAS(IntDefaultHandler);
 101:../src/cr_startup_lpc43xx-m0app.c **** void LCD_IRQHandler(void) ALIAS(IntDefaultHandler);
 102:../src/cr_startup_lpc43xx-m0app.c **** void USB0_IRQHandler(void) ALIAS(IntDefaultHandler);
 103:../src/cr_startup_lpc43xx-m0app.c **** void USB1_IRQHandler(void) ALIAS(IntDefaultHandler);
 104:../src/cr_startup_lpc43xx-m0app.c **** void SCT_IRQHandler(void) ALIAS(IntDefaultHandler);
 105:../src/cr_startup_lpc43xx-m0app.c **** void RIT_IRQHandler(void) ALIAS(IntDefaultHandler);
 106:../src/cr_startup_lpc43xx-m0app.c **** void TIMER0_IRQHandler(void) ALIAS(IntDefaultHandler);
 107:../src/cr_startup_lpc43xx-m0app.c **** void GINT1_IRQHandler(void) ALIAS(IntDefaultHandler);
 108:../src/cr_startup_lpc43xx-m0app.c **** void GPIO4_IRQHandler(void) ALIAS(IntDefaultHandler);
 109:../src/cr_startup_lpc43xx-m0app.c **** void TIMER3_IRQHandler(void) ALIAS(IntDefaultHandler);
 110:../src/cr_startup_lpc43xx-m0app.c **** void MCPWM_IRQHandler(void) ALIAS(IntDefaultHandler);
 111:../src/cr_startup_lpc43xx-m0app.c **** void ADC0_IRQHandler(void) ALIAS(IntDefaultHandler);
 112:../src/cr_startup_lpc43xx-m0app.c **** void I2C0_IRQHandler(void) ALIAS(IntDefaultHandler);
 113:../src/cr_startup_lpc43xx-m0app.c **** void SGPIO_IRQHandler(void) ALIAS(IntDefaultHandler);
 114:../src/cr_startup_lpc43xx-m0app.c **** void SPI_IRQHandler (void) ALIAS(IntDefaultHandler);
 115:../src/cr_startup_lpc43xx-m0app.c **** void ADC1_IRQHandler(void) ALIAS(IntDefaultHandler);
 116:../src/cr_startup_lpc43xx-m0app.c **** void SSP0_IRQHandler(void) ALIAS(IntDefaultHandler);
 117:../src/cr_startup_lpc43xx-m0app.c **** void EVRT_IRQHandler(void) ALIAS(IntDefaultHandler);
 118:../src/cr_startup_lpc43xx-m0app.c **** void UART0_IRQHandler(void) ALIAS(IntDefaultHandler);
 119:../src/cr_startup_lpc43xx-m0app.c **** void UART1_IRQHandler(void) ALIAS(IntDefaultHandler);
 120:../src/cr_startup_lpc43xx-m0app.c **** void UART2_IRQHandler(void) ALIAS(IntDefaultHandler);
 121:../src/cr_startup_lpc43xx-m0app.c **** void UART3_IRQHandler(void) ALIAS(IntDefaultHandler);
 122:../src/cr_startup_lpc43xx-m0app.c **** void I2S0_IRQHandler(void) ALIAS(IntDefaultHandler);
 123:../src/cr_startup_lpc43xx-m0app.c **** void CAN0_IRQHandler(void) ALIAS(IntDefaultHandler);
 124:../src/cr_startup_lpc43xx-m0app.c **** void SPIFI_ADCHS_IRQHandler(void) ALIAS(IntDefaultHandler);
 125:../src/cr_startup_lpc43xx-m0app.c **** void M0SUB_IRQHandler(void) ALIAS(IntDefaultHandler);
 126:../src/cr_startup_lpc43xx-m0app.c **** #else
 127:../src/cr_startup_lpc43xx-m0app.c **** void M0_RTC_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 128:../src/cr_startup_lpc43xx-m0app.c **** void M0_M4CORE_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 129:../src/cr_startup_lpc43xx-m0app.c **** void M0_DMA_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 130:../src/cr_startup_lpc43xx-m0app.c **** void M0_ETH_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 131:../src/cr_startup_lpc43xx-m0app.c **** void M0_SDIO_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 132:../src/cr_startup_lpc43xx-m0app.c **** void M0_LCD_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 133:../src/cr_startup_lpc43xx-m0app.c **** void M0_USB0_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 134:../src/cr_startup_lpc43xx-m0app.c **** void M0_USB1_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 135:../src/cr_startup_lpc43xx-m0app.c **** void M0_SCT_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 136:../src/cr_startup_lpc43xx-m0app.c **** void M0_RIT_OR_WWDT_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 137:../src/cr_startup_lpc43xx-m0app.c **** void M0_TIMER0_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 138:../src/cr_startup_lpc43xx-m0app.c **** void M0_GINT1_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 139:../src/cr_startup_lpc43xx-m0app.c **** void M0_TIMER3_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 140:../src/cr_startup_lpc43xx-m0app.c **** void M0_MCPWM_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 141:../src/cr_startup_lpc43xx-m0app.c **** void M0_ADC0_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 142:../src/cr_startup_lpc43xx-m0app.c **** void M0_I2C0_OR_I2C1_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 143:../src/cr_startup_lpc43xx-m0app.c **** void M0_SGPIO_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 144:../src/cr_startup_lpc43xx-m0app.c **** void M0_SPI_OR_DAC_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 145:../src/cr_startup_lpc43xx-m0app.c **** void M0_ADC1_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 146:../src/cr_startup_lpc43xx-m0app.c **** void M0_SSP0_OR_SSP1_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 147:../src/cr_startup_lpc43xx-m0app.c **** void M0_EVENTROUTER_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 148:../src/cr_startup_lpc43xx-m0app.c **** void M0_USART0_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 149:../src/cr_startup_lpc43xx-m0app.c **** void M0_USART2_OR_C_CAN1_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 150:../src/cr_startup_lpc43xx-m0app.c **** void M0_USART3_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 151:../src/cr_startup_lpc43xx-m0app.c **** void M0_I2S0_OR_I2S1_OR_QEI_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 152:../src/cr_startup_lpc43xx-m0app.c **** void M0_C_CAN0_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 153:../src/cr_startup_lpc43xx-m0app.c **** void M0_SPIFI_OR_VADC_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 154:../src/cr_startup_lpc43xx-m0app.c **** void M0_M0SUB_IRQHandler(void) ALIAS(M0_IntDefaultHandler);
 155:../src/cr_startup_lpc43xx-m0app.c **** #endif
 156:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 157:../src/cr_startup_lpc43xx-m0app.c **** //
 158:../src/cr_startup_lpc43xx-m0app.c **** // The entry point for the application.
 159:../src/cr_startup_lpc43xx-m0app.c **** // __main() is the entry point for Redlib based applications
 160:../src/cr_startup_lpc43xx-m0app.c **** // main() is the entry point for Newlib based applications
 161:../src/cr_startup_lpc43xx-m0app.c **** //
 162:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 163:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__REDLIB__)
 164:../src/cr_startup_lpc43xx-m0app.c **** extern void __main(void);
 165:../src/cr_startup_lpc43xx-m0app.c **** #endif
 166:../src/cr_startup_lpc43xx-m0app.c **** extern int main(void);
 167:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 168:../src/cr_startup_lpc43xx-m0app.c **** //
 169:../src/cr_startup_lpc43xx-m0app.c **** // External declaration for the pointer to the stack top from the Linker Script
 170:../src/cr_startup_lpc43xx-m0app.c **** //
 171:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 172:../src/cr_startup_lpc43xx-m0app.c **** extern void _vStackTop(void);
 173:../src/cr_startup_lpc43xx-m0app.c **** 
 174:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 175:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__cplusplus)
 176:../src/cr_startup_lpc43xx-m0app.c **** } // extern "C"
 177:../src/cr_startup_lpc43xx-m0app.c **** #endif
 178:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 179:../src/cr_startup_lpc43xx-m0app.c **** //
 180:../src/cr_startup_lpc43xx-m0app.c **** // The vector table.
 181:../src/cr_startup_lpc43xx-m0app.c **** // This relies on the linker script to place at correct location in memory.
 182:../src/cr_startup_lpc43xx-m0app.c **** //
 183:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 184:../src/cr_startup_lpc43xx-m0app.c **** extern void (* const g_pfnVectors[])(void);
 185:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".isr_vector")))
 186:../src/cr_startup_lpc43xx-m0app.c **** void (* const g_pfnVectors[])(void) = {
 187:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
 188:../src/cr_startup_lpc43xx-m0app.c ****     // Core Level - CM0
 189:../src/cr_startup_lpc43xx-m0app.c ****     &_vStackTop,                        // The initial stack pointer
 190:../src/cr_startup_lpc43xx-m0app.c ****     ResetISR,                           // 1 The reset handler
 191:../src/cr_startup_lpc43xx-m0app.c ****     NMI_Handler,                    // The NMI handler
 192:../src/cr_startup_lpc43xx-m0app.c ****     HardFault_Handler,              // The hard fault handler
 193:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 4 Reserved
 194:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 5 Reserved
 195:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 6 Reserved
 196:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 7 Reserved
 197:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 8 Reserved
 198:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 9 Reserved
 199:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 10 Reserved
 200:../src/cr_startup_lpc43xx-m0app.c ****     SVC_Handler,                    // SVCall handler
 201:../src/cr_startup_lpc43xx-m0app.c ****     0,                              // Reserved
 202:../src/cr_startup_lpc43xx-m0app.c ****     0,                              // Reserved
 203:../src/cr_startup_lpc43xx-m0app.c ****     PendSV_Handler,                 // The PendSV handler
 204:../src/cr_startup_lpc43xx-m0app.c ****     SysTick_Handler,                // The SysTick handler
 205:../src/cr_startup_lpc43xx-m0app.c **** 
 206:../src/cr_startup_lpc43xx-m0app.c ****     // Chip Level - 43xx M0 core
 207:../src/cr_startup_lpc43xx-m0app.c ****     RTC_IRQHandler,                 // 16 RTC
 208:../src/cr_startup_lpc43xx-m0app.c ****     MX_CORE_IRQHandler,             // 17 CortexM4/M0 (LPC43XX ONLY)
 209:../src/cr_startup_lpc43xx-m0app.c ****     DMA_IRQHandler,                 // 18 General Purpose DMA
 210:../src/cr_startup_lpc43xx-m0app.c ****     0,                              // 19 Reserved
 211:../src/cr_startup_lpc43xx-m0app.c ****     FLASHEEPROM_IRQHandler,         // 20 ORed flash Bank A, flash Bank B, EEPROM interrupts
 212:../src/cr_startup_lpc43xx-m0app.c ****     ETH_IRQHandler,                 // 21 Ethernet
 213:../src/cr_startup_lpc43xx-m0app.c ****     SDIO_IRQHandler,                // 22 SD/MMC
 214:../src/cr_startup_lpc43xx-m0app.c ****     LCD_IRQHandler,                 // 23 LCD
 215:../src/cr_startup_lpc43xx-m0app.c ****     USB0_IRQHandler,                // 24 USB0
 216:../src/cr_startup_lpc43xx-m0app.c ****     USB1_IRQHandler,                // 25 USB1
 217:../src/cr_startup_lpc43xx-m0app.c ****     SCT_IRQHandler,                 // 26 State Configurable Timer
 218:../src/cr_startup_lpc43xx-m0app.c ****     RIT_IRQHandler,                 // 27 ORed Repetitive Interrupt Timer, WWDT
 219:../src/cr_startup_lpc43xx-m0app.c ****     TIMER0_IRQHandler,              // 28 Timer0
 220:../src/cr_startup_lpc43xx-m0app.c ****     GINT1_IRQHandler,               // 29 GINT1
 221:../src/cr_startup_lpc43xx-m0app.c ****     GPIO4_IRQHandler,               // 30 GPIO4
 222:../src/cr_startup_lpc43xx-m0app.c ****     TIMER3_IRQHandler,              // 31 Timer 3
 223:../src/cr_startup_lpc43xx-m0app.c ****     MCPWM_IRQHandler,               // 32 Motor Control PWM
 224:../src/cr_startup_lpc43xx-m0app.c ****     ADC0_IRQHandler,                // 33 A/D Converter 0
 225:../src/cr_startup_lpc43xx-m0app.c ****     I2C0_IRQHandler,                // 34 ORed I2C0, I2C1
 226:../src/cr_startup_lpc43xx-m0app.c ****     SGPIO_IRQHandler,               // 35 SGPIO (LPC43XX ONLY)
 227:../src/cr_startup_lpc43xx-m0app.c ****     SPI_IRQHandler,                 // 36 ORed SPI, DAC (LPC43XX ONLY)
