wowHollis/SmartCart/src/camera/pixy/misc/gcc/m0/Release/cr_startup_lpc43xx-m0app.asm
 228:../src/cr_startup_lpc43xx-m0app.c ****     ADC1_IRQHandler,                // 37 A/D Converter 1
 229:../src/cr_startup_lpc43xx-m0app.c ****     SSP0_IRQHandler,                // 38 ORed SSP0, SSP1
 230:../src/cr_startup_lpc43xx-m0app.c ****     EVRT_IRQHandler,                // 39 Event Router
 231:../src/cr_startup_lpc43xx-m0app.c ****     UART0_IRQHandler,               // 40 UART0
 232:../src/cr_startup_lpc43xx-m0app.c ****     UART1_IRQHandler,               // 41 UART1
 233:../src/cr_startup_lpc43xx-m0app.c ****     UART2_IRQHandler,               // 42 UART2
 234:../src/cr_startup_lpc43xx-m0app.c ****     UART3_IRQHandler,               // 43 USRT3
 235:../src/cr_startup_lpc43xx-m0app.c ****     I2S0_IRQHandler,                // 44 ORed I2S0, I2S1
 236:../src/cr_startup_lpc43xx-m0app.c ****     CAN0_IRQHandler,                // 45 C_CAN0
 237:../src/cr_startup_lpc43xx-m0app.c ****     SPIFI_ADCHS_IRQHandler,         // 46 SPIFI OR ADCHS interrupt
 238:../src/cr_startup_lpc43xx-m0app.c ****     M0SUB_IRQHandler,               // 47 M0SUB core
 239:../src/cr_startup_lpc43xx-m0app.c **** };
 240:../src/cr_startup_lpc43xx-m0app.c **** #else
 241:../src/cr_startup_lpc43xx-m0app.c ****     // Core Level - CM0
 242:../src/cr_startup_lpc43xx-m0app.c ****     &_vStackTop,                        // The initial stack pointer
 243:../src/cr_startup_lpc43xx-m0app.c ****     ResetISR,                           // 1 The reset handler
 244:../src/cr_startup_lpc43xx-m0app.c ****     M0_NMI_Handler,                     // 2 The NMI handler
 245:../src/cr_startup_lpc43xx-m0app.c ****     M0_HardFault_Handler,               // 3 The hard fault handler
 246:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 4 Reserved
 247:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 5 Reserved
 248:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 6 Reserved
 249:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 7 Reserved
 250:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 8 Reserved
 251:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 9 Reserved
 252:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 10 Reserved
 253:../src/cr_startup_lpc43xx-m0app.c ****     M0_SVC_Handler,                     // 11 SVCall handler
 254:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 12 Reserved
 255:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 13 Reserved
 256:../src/cr_startup_lpc43xx-m0app.c ****     M0_PendSV_Handler,                  // 14 The PendSV handler
 257:../src/cr_startup_lpc43xx-m0app.c ****     M0_SysTick_Handler,                 // 15 The SysTick handler
 258:../src/cr_startup_lpc43xx-m0app.c **** 
 259:../src/cr_startup_lpc43xx-m0app.c ****     // Chip Level - LPC43 (CM0 APP)
 260:../src/cr_startup_lpc43xx-m0app.c ****         M0_RTC_IRQHandler,              // 16 RTC
 261:../src/cr_startup_lpc43xx-m0app.c ****     M0_M4CORE_IRQHandler,               // 17 Interrupt from M4 Core
 262:../src/cr_startup_lpc43xx-m0app.c ****     M0_DMA_IRQHandler,                  // 18 General Purpose DMA
 263:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 19 Reserved
 264:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 20 Reserved
 265:../src/cr_startup_lpc43xx-m0app.c ****     M0_ETH_IRQHandler,                  // 21 Ethernet
 266:../src/cr_startup_lpc43xx-m0app.c ****     M0_SDIO_IRQHandler,                 // 22 SD/MMC
 267:../src/cr_startup_lpc43xx-m0app.c ****     M0_LCD_IRQHandler,                  // 23 LCD
 268:../src/cr_startup_lpc43xx-m0app.c ****     M0_USB0_IRQHandler,                 // 24 USB0
 269:../src/cr_startup_lpc43xx-m0app.c ****     M0_USB1_IRQHandler,                 // 25 USB1
 270:../src/cr_startup_lpc43xx-m0app.c ****     M0_SCT_IRQHandler ,                 // 26 State Configurable Timer
 271:../src/cr_startup_lpc43xx-m0app.c ****     M0_RIT_OR_WWDT_IRQHandler,          // 27 Repetitive Interrupt Timer
 272:../src/cr_startup_lpc43xx-m0app.c ****     M0_TIMER0_IRQHandler,               // 28 Timer0
 273:../src/cr_startup_lpc43xx-m0app.c ****     M0_GINT1_IRQHandler,                // 29 GINT1
 274:../src/cr_startup_lpc43xx-m0app.c ****     M0_TIMER3_IRQHandler,               // 30 Timer3
 275:../src/cr_startup_lpc43xx-m0app.c ****     0,                                  // 31 Reserved
 276:../src/cr_startup_lpc43xx-m0app.c ****     0 ,                                 // 32 Reserved
 277:../src/cr_startup_lpc43xx-m0app.c ****     M0_MCPWM_IRQHandler,                // 33 Motor Control PWM
 278:../src/cr_startup_lpc43xx-m0app.c ****     M0_ADC0_IRQHandler,                 // 34 ADC0
 279:../src/cr_startup_lpc43xx-m0app.c ****     M0_I2C0_OR_I2C1_IRQHandler,         // 35 I2C0 or I2C1
 280:../src/cr_startup_lpc43xx-m0app.c ****     M0_SGPIO_IRQHandler,                // 36 Serial GPIO
 281:../src/cr_startup_lpc43xx-m0app.c ****     M0_SPI_OR_DAC_IRQHandler,           // 37 SPI or DAC
 282:../src/cr_startup_lpc43xx-m0app.c ****     M0_ADC1_IRQHandler,                 // 38 ADC1
 283:../src/cr_startup_lpc43xx-m0app.c ****     M0_SSP0_OR_SSP1_IRQHandler,         // 39 SSP0 or SSP1
 284:../src/cr_startup_lpc43xx-m0app.c ****     M0_EVENTROUTER_IRQHandler,          // 40 Event Router
 285:../src/cr_startup_lpc43xx-m0app.c ****     M0_USART0_IRQHandler,               // 41 USART0
 286:../src/cr_startup_lpc43xx-m0app.c ****     M0_USART2_OR_C_CAN1_IRQHandler,     // 42 USART2 or C CAN1
 287:../src/cr_startup_lpc43xx-m0app.c ****     M0_USART3_IRQHandler,               // 43 USART3
 288:../src/cr_startup_lpc43xx-m0app.c ****     M0_I2S0_OR_I2S1_OR_QEI_IRQHandler,  // 44 I2S0 or I2S1 or QEI
 289:../src/cr_startup_lpc43xx-m0app.c ****     M0_C_CAN0_IRQHandler,               // 45 C CAN0
 290:../src/cr_startup_lpc43xx-m0app.c ****     M0_SPIFI_OR_VADC_IRQHandler,        // 46
 291:../src/cr_startup_lpc43xx-m0app.c ****     M0_M0SUB_IRQHandler,                // 47 Interrupt from M0SUB
 292:../src/cr_startup_lpc43xx-m0app.c ****   };
 293:../src/cr_startup_lpc43xx-m0app.c **** #endif
 294:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 295:../src/cr_startup_lpc43xx-m0app.c **** // Functions to carry out the initialization of RW and BSS data sections. These
 296:../src/cr_startup_lpc43xx-m0app.c **** // are written as separate functions rather than being inlined within the
 297:../src/cr_startup_lpc43xx-m0app.c **** // ResetISR() function in order to cope with MCUs with multiple banks of
 298:../src/cr_startup_lpc43xx-m0app.c **** // memory.
 299:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 300:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".after_vectors")))
 301:../src/cr_startup_lpc43xx-m0app.c **** void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
  82              		.loc 1 301 0
  83              		.cfi_startproc
  84 0000 80B5     		push	{r7, lr}
  85              		.cfi_def_cfa_offset 8
  86              		.cfi_offset 7, -8
  87              		.cfi_offset 14, -4
  88 0002 88B0     		sub	sp, sp, #32
  89              		.cfi_def_cfa_offset 40
  90 0004 00AF     		add	r7, sp, #0
  91              		.cfi_def_cfa_register 7
  92 0006 F860     		str	r0, [r7, #12]
  93 0008 B960     		str	r1, [r7, #8]
  94 000a 7A60     		str	r2, [r7, #4]
 302:../src/cr_startup_lpc43xx-m0app.c ****   unsigned int *pulDest = (unsigned int*) start;
  95              		.loc 1 302 0
  96 000c BB68     		ldr	r3, [r7, #8]
  97 000e FB61     		str	r3, [r7, #28]
 303:../src/cr_startup_lpc43xx-m0app.c ****   unsigned int *pulSrc = (unsigned int*) romstart;
  98              		.loc 1 303 0
  99 0010 FB68     		ldr	r3, [r7, #12]
 100 0012 BB61     		str	r3, [r7, #24]
 304:../src/cr_startup_lpc43xx-m0app.c ****   unsigned int loop;
 305:../src/cr_startup_lpc43xx-m0app.c ****   for (loop = 0; loop < len; loop = loop + 4)
 101              		.loc 1 305 0
 102 0014 0023     		movs	r3, #0
 103 0016 7B61     		str	r3, [r7, #20]
 104 0018 0AE0     		b	.L2
 105              	.L3:
 306:../src/cr_startup_lpc43xx-m0app.c ****     *pulDest++ = *pulSrc++;
 106              		.loc 1 306 0 discriminator 3
 107 001a FB69     		ldr	r3, [r7, #28]
 108 001c 1A1D     		adds	r2, r3, #4
 109 001e FA61     		str	r2, [r7, #28]
 110 0020 BA69     		ldr	r2, [r7, #24]
 111 0022 111D     		adds	r1, r2, #4
 112 0024 B961     		str	r1, [r7, #24]
 113 0026 1268     		ldr	r2, [r2]
 114 0028 1A60     		str	r2, [r3]
 305:../src/cr_startup_lpc43xx-m0app.c ****     *pulDest++ = *pulSrc++;
 115              		.loc 1 305 0 discriminator 3
 116 002a 7B69     		ldr	r3, [r7, #20]
 117 002c 0433     		adds	r3, r3, #4
 118 002e 7B61     		str	r3, [r7, #20]
 119              	.L2:
 305:../src/cr_startup_lpc43xx-m0app.c ****     *pulDest++ = *pulSrc++;
 120              		.loc 1 305 0 is_stmt 0 discriminator 1
 121 0030 7A69     		ldr	r2, [r7, #20]
 122 0032 7B68     		ldr	r3, [r7, #4]
 123 0034 9A42     		cmp	r2, r3
 124 0036 F0D3     		bcc	.L3
 307:../src/cr_startup_lpc43xx-m0app.c **** }
 125              		.loc 1 307 0 is_stmt 1
 126 0038 C046     		nop
 127 003a BD46     		mov	sp, r7
 128 003c 08B0     		add	sp, sp, #32
 129              		@ sp needed
 130 003e 80BD     		pop	{r7, pc}
 131              		.cfi_endproc
 132              	.LFE32:
 134              		.align	2
 135              		.global	bss_init
 136              		.code	16
 137              		.thumb_func
 139              	bss_init:
 140              	.LFB33:
 308:../src/cr_startup_lpc43xx-m0app.c **** 
 309:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".after_vectors")))
 310:../src/cr_startup_lpc43xx-m0app.c **** void bss_init(unsigned int start, unsigned int len) {
 141              		.loc 1 310 0
 142              		.cfi_startproc
 143 0040 80B5     		push	{r7, lr}
 144              		.cfi_def_cfa_offset 8
 145              		.cfi_offset 7, -8
 146              		.cfi_offset 14, -4
 147 0042 84B0     		sub	sp, sp, #16
 148              		.cfi_def_cfa_offset 24
 149 0044 00AF     		add	r7, sp, #0
 150              		.cfi_def_cfa_register 7
 151 0046 7860     		str	r0, [r7, #4]
 152 0048 3960     		str	r1, [r7]
 311:../src/cr_startup_lpc43xx-m0app.c ****   unsigned int *pulDest = (unsigned int*) start;
 153              		.loc 1 311 0
 154 004a 7B68     		ldr	r3, [r7, #4]
 155 004c FB60     		str	r3, [r7, #12]
 312:../src/cr_startup_lpc43xx-m0app.c ****   unsigned int loop;
 313:../src/cr_startup_lpc43xx-m0app.c ****   for (loop = 0; loop < len; loop = loop + 4)
 156              		.loc 1 313 0
 157 004e 0023     		movs	r3, #0
 158 0050 BB60     		str	r3, [r7, #8]
 159 0052 07E0     		b	.L5
 160              	.L6:
 314:../src/cr_startup_lpc43xx-m0app.c ****     *pulDest++ = 0;
 161              		.loc 1 314 0 discriminator 3
 162 0054 FB68     		ldr	r3, [r7, #12]
 163 0056 1A1D     		adds	r2, r3, #4
 164 0058 FA60     		str	r2, [r7, #12]
 165 005a 0022     		movs	r2, #0
 166 005c 1A60     		str	r2, [r3]
 313:../src/cr_startup_lpc43xx-m0app.c ****     *pulDest++ = 0;
 167              		.loc 1 313 0 discriminator 3
 168 005e BB68     		ldr	r3, [r7, #8]
 169 0060 0433     		adds	r3, r3, #4
 170 0062 BB60     		str	r3, [r7, #8]
 171              	.L5:
 313:../src/cr_startup_lpc43xx-m0app.c ****     *pulDest++ = 0;
 172              		.loc 1 313 0 is_stmt 0 discriminator 1
 173 0064 BA68     		ldr	r2, [r7, #8]
 174 0066 3B68     		ldr	r3, [r7]
 175 0068 9A42     		cmp	r2, r3
 176 006a F3D3     		bcc	.L6
 315:../src/cr_startup_lpc43xx-m0app.c **** }
 177              		.loc 1 315 0 is_stmt 1
 178 006c C046     		nop
 179 006e BD46     		mov	sp, r7
 180 0070 04B0     		add	sp, sp, #16
 181              		@ sp needed
 182 0072 80BD     		pop	{r7, pc}
 183              		.cfi_endproc
 184              	.LFE33:
 186              		.section	.text.ResetISR,"ax",%progbits
 187              		.align	2
 188              		.global	ResetISR
 189              		.code	16
 190              		.thumb_func
 192              	ResetISR:
 193              	.LFB34:
 316:../src/cr_startup_lpc43xx-m0app.c **** 
 317:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 318:../src/cr_startup_lpc43xx-m0app.c **** // The following symbols are constructs generated by the linker, indicating
 319:../src/cr_startup_lpc43xx-m0app.c **** // the location of various points in the "Global Section Table". This table is
 320:../src/cr_startup_lpc43xx-m0app.c **** // created by the linker via the Code Red managed linker script mechanism. It
 321:../src/cr_startup_lpc43xx-m0app.c **** // contains the load address, execution address and length of each RW data
 322:../src/cr_startup_lpc43xx-m0app.c **** // section and the execution and length of each BSS (zero initialized) section.
 323:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 324:../src/cr_startup_lpc43xx-m0app.c **** extern unsigned int __data_section_table;
 325:../src/cr_startup_lpc43xx-m0app.c **** extern unsigned int __data_section_table_end;
 326:../src/cr_startup_lpc43xx-m0app.c **** extern unsigned int __bss_section_table;
 327:../src/cr_startup_lpc43xx-m0app.c **** extern unsigned int __bss_section_table_end;
 328:../src/cr_startup_lpc43xx-m0app.c **** 
 329:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 330:../src/cr_startup_lpc43xx-m0app.c **** // Reset entry point for your code.
 331:../src/cr_startup_lpc43xx-m0app.c **** // Sets up a simple runtime environment and initializes the C/C++
 332:../src/cr_startup_lpc43xx-m0app.c **** // library.
 333:../src/cr_startup_lpc43xx-m0app.c **** //
 334:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 335:../src/cr_startup_lpc43xx-m0app.c **** void
 336:../src/cr_startup_lpc43xx-m0app.c **** ResetISR(void) {
 194              		.loc 1 336 0
 195              		.cfi_startproc
 196 0000 80B5     		push	{r7, lr}
 197              		.cfi_def_cfa_offset 8
 198              		.cfi_offset 7, -8
 199              		.cfi_offset 14, -4
 200 0002 86B0     		sub	sp, sp, #24
 201              		.cfi_def_cfa_offset 32
 202 0004 00AF     		add	r7, sp, #0
 203              		.cfi_def_cfa_register 7
 337:../src/cr_startup_lpc43xx-m0app.c **** 
 338:../src/cr_startup_lpc43xx-m0app.c ****   // ******************************
 339:../src/cr_startup_lpc43xx-m0app.c ****   // Modify CREG->M0APPMAP so that M0 looks in correct place
 340:../src/cr_startup_lpc43xx-m0app.c ****   // for its vector table when an exception is triggered.
 341:../src/cr_startup_lpc43xx-m0app.c ****   // Note that we do not use the CMSIS register access mechanism,
 342:../src/cr_startup_lpc43xx-m0app.c ****   // as there is no guarantee that the project has been configured
 343:../src/cr_startup_lpc43xx-m0app.c ****   // to use CMSIS.
 344:../src/cr_startup_lpc43xx-m0app.c ****   unsigned int *pCREG_M0APPMAP = (unsigned int *) 0x40043404;
 204              		.loc 1 344 0
 205 0006 1C4B     		ldr	r3, .L13
 206 0008 3B61     		str	r3, [r7, #16]
 345:../src/cr_startup_lpc43xx-m0app.c ****   // CMSIS : CREG->M0APPMAP = <address of vector table>
 346:../src/cr_startup_lpc43xx-m0app.c ****   *pCREG_M0APPMAP = (unsigned int)g_pfnVectors;
 207              		.loc 1 346 0
 208 000a 1C4A     		ldr	r2, .L13+4
 209 000c 3B69     		ldr	r3, [r7, #16]
 210 000e 1A60     		str	r2, [r3]
 347:../src/cr_startup_lpc43xx-m0app.c **** 
 348:../src/cr_startup_lpc43xx-m0app.c ****     //
 349:../src/cr_startup_lpc43xx-m0app.c ****     // Copy the data sections from flash to SRAM.
 350:../src/cr_startup_lpc43xx-m0app.c ****     //
 351:../src/cr_startup_lpc43xx-m0app.c ****   unsigned int LoadAddr, ExeAddr, SectionLen;
 352:../src/cr_startup_lpc43xx-m0app.c ****   unsigned int *SectionTableAddr;
 353:../src/cr_startup_lpc43xx-m0app.c **** 
 354:../src/cr_startup_lpc43xx-m0app.c ****   // Load base address of Global Section Table
 355:../src/cr_startup_lpc43xx-m0app.c ****   SectionTableAddr = &__data_section_table;
 211              		.loc 1 355 0
 212 0010 1B4B     		ldr	r3, .L13+8
 213 0012 7B61     		str	r3, [r7, #20]
 356:../src/cr_startup_lpc43xx-m0app.c **** 
 357:../src/cr_startup_lpc43xx-m0app.c ****     // Copy the data sections from flash to SRAM.
 358:../src/cr_startup_lpc43xx-m0app.c ****   while (SectionTableAddr < &__data_section_table_end) {
 214              		.loc 1 358 0
 215 0014 14E0     		b	.L8
 216              	.L9:
 359:../src/cr_startup_lpc43xx-m0app.c ****     LoadAddr = *SectionTableAddr++;
 217              		.loc 1 359 0
 218 0016 7B69     		ldr	r3, [r7, #20]
 219 0018 1A1D     		adds	r2, r3, #4
 220 001a 7A61     		str	r2, [r7, #20]
 221 001c 1B68     		ldr	r3, [r3]
 222 001e FB60     		str	r3, [r7, #12]
 360:../src/cr_startup_lpc43xx-m0app.c ****     ExeAddr = *SectionTableAddr++;
 223              		.loc 1 360 0
 224 0020 7B69     		ldr	r3, [r7, #20]
 225 0022 1A1D     		adds	r2, r3, #4
 226 0024 7A61     		str	r2, [r7, #20]
 227 0026 1B68     		ldr	r3, [r3]
 228 0028 BB60     		str	r3, [r7, #8]
 361:../src/cr_startup_lpc43xx-m0app.c ****     SectionLen = *SectionTableAddr++;
 229              		.loc 1 361 0
 230 002a 7B69     		ldr	r3, [r7, #20]
 231 002c 1A1D     		adds	r2, r3, #4
 232 002e 7A61     		str	r2, [r7, #20]
 233 0030 1B68     		ldr	r3, [r3]
 234 0032 7B60     		str	r3, [r7, #4]
 362:../src/cr_startup_lpc43xx-m0app.c ****     data_init(LoadAddr, ExeAddr, SectionLen);
 235              		.loc 1 362 0
 236 0034 7A68     		ldr	r2, [r7, #4]
 237 0036 B968     		ldr	r1, [r7, #8]
 238 0038 FB68     		ldr	r3, [r7, #12]
 239 003a 1800     		movs	r0, r3
 240 003c FFF7FEFF 		bl	data_init
 241              	.L8:
 358:../src/cr_startup_lpc43xx-m0app.c ****     LoadAddr = *SectionTableAddr++;
 242              		.loc 1 358 0
 243 0040 7A69     		ldr	r2, [r7, #20]
 244 0042 104B     		ldr	r3, .L13+12
 245 0044 9A42     		cmp	r2, r3
 246 0046 E6D3     		bcc	.L9
 363:../src/cr_startup_lpc43xx-m0app.c ****   }
 364:../src/cr_startup_lpc43xx-m0app.c ****   // At this point, SectionTableAddr = &__bss_section_table;
 365:../src/cr_startup_lpc43xx-m0app.c ****   // Zero fill the bss segment
 366:../src/cr_startup_lpc43xx-m0app.c ****   while (SectionTableAddr < &__bss_section_table_end) {
 247              		.loc 1 366 0
 248 0048 0FE0     		b	.L10
 249              	.L11:
 367:../src/cr_startup_lpc43xx-m0app.c ****     ExeAddr = *SectionTableAddr++;
 250              		.loc 1 367 0
 251 004a 7B69     		ldr	r3, [r7, #20]
 252 004c 1A1D     		adds	r2, r3, #4
 253 004e 7A61     		str	r2, [r7, #20]
 254 0050 1B68     		ldr	r3, [r3]
 255 0052 BB60     		str	r3, [r7, #8]
 368:../src/cr_startup_lpc43xx-m0app.c ****     SectionLen = *SectionTableAddr++;
 256              		.loc 1 368 0
 257 0054 7B69     		ldr	r3, [r7, #20]
 258 0056 1A1D     		adds	r2, r3, #4
 259 0058 7A61     		str	r2, [r7, #20]
 260 005a 1B68     		ldr	r3, [r3]
 261 005c 7B60     		str	r3, [r7, #4]
 369:../src/cr_startup_lpc43xx-m0app.c ****     bss_init(ExeAddr, SectionLen);
 262              		.loc 1 369 0
 263 005e 7A68     		ldr	r2, [r7, #4]
 264 0060 BB68     		ldr	r3, [r7, #8]
 265 0062 1100     		movs	r1, r2
 266 0064 1800     		movs	r0, r3
 267 0066 FFF7FEFF 		bl	bss_init
 268              	.L10:
 366:../src/cr_startup_lpc43xx-m0app.c ****     ExeAddr = *SectionTableAddr++;
 269              		.loc 1 366 0
 270 006a 7A69     		ldr	r2, [r7, #20]
 271 006c 064B     		ldr	r3, .L13+16
 272 006e 9A42     		cmp	r2, r3
 273 0070 EBD3     		bcc	.L11
 370:../src/cr_startup_lpc43xx-m0app.c ****   }
 371:../src/cr_startup_lpc43xx-m0app.c **** 
 372:../src/cr_startup_lpc43xx-m0app.c **** // **********************************************************
 373:../src/cr_startup_lpc43xx-m0app.c **** // No need to call SystemInit() here, as master CM4 cpu will
 374:../src/cr_startup_lpc43xx-m0app.c **** // have done the main system set up before enabling CM0.
 375:../src/cr_startup_lpc43xx-m0app.c **** // **********************************************************
 376:../src/cr_startup_lpc43xx-m0app.c **** 
 377:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__cplusplus)
 378:../src/cr_startup_lpc43xx-m0app.c ****   //
 379:../src/cr_startup_lpc43xx-m0app.c ****   // Call C++ library initialisation
 380:../src/cr_startup_lpc43xx-m0app.c ****   //
 381:../src/cr_startup_lpc43xx-m0app.c ****   __libc_init_array();
 382:../src/cr_startup_lpc43xx-m0app.c **** #endif
 383:../src/cr_startup_lpc43xx-m0app.c **** 
 384:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__REDLIB__)
 385:../src/cr_startup_lpc43xx-m0app.c ****   // Call the Redlib library, which in turn calls main()
 386:../src/cr_startup_lpc43xx-m0app.c ****   __main() ;
 274              		.loc 1 386 0
 275 0072 FFF7FEFF 		bl	__main
 276              	.L12:
 387:../src/cr_startup_lpc43xx-m0app.c **** #else
 388:../src/cr_startup_lpc43xx-m0app.c ****   main();
 389:../src/cr_startup_lpc43xx-m0app.c **** #endif
 390:../src/cr_startup_lpc43xx-m0app.c **** 
 391:../src/cr_startup_lpc43xx-m0app.c ****   //
 392:../src/cr_startup_lpc43xx-m0app.c ****   // main() shouldn't return, but if it does, we'll just enter an infinite loop 
 393:../src/cr_startup_lpc43xx-m0app.c ****   //
 394:../src/cr_startup_lpc43xx-m0app.c ****   while (1) {
 395:../src/cr_startup_lpc43xx-m0app.c ****     ;
 396:../src/cr_startup_lpc43xx-m0app.c ****   }
 277              		.loc 1 396 0 discriminator 1
 278 0076 FEE7     		b	.L12
 279              	.L14:
 280              		.align	2
 281              	.L13:
 282 0078 04340440 		.word	1074017284
 283 007c 00000000 		.word	g_pfnVectors
 284 0080 00000000 		.word	__data_section_table
 285 0084 00000000 		.word	__data_section_table_end
 286 0088 00000000 		.word	__bss_section_table_end
 287              		.cfi_endproc
 288              	.LFE34:
 290              		.section	.after_vectors
 291              		.align	2
 292              		.weak	M0_NMI_Handler
 293              		.code	16
 294              		.thumb_func
 296              	M0_NMI_Handler:
 297              	.LFB35:
 397:../src/cr_startup_lpc43xx-m0app.c **** }
 398:../src/cr_startup_lpc43xx-m0app.c **** 
 399:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 400:../src/cr_startup_lpc43xx-m0app.c **** // Default exception handlers. Override the ones here by defining your own
 401:../src/cr_startup_lpc43xx-m0app.c **** // handler routines in your application code.
 402:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 403:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".after_vectors")))
 404:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
 405:../src/cr_startup_lpc43xx-m0app.c **** void NMI_Handler(void)
 406:../src/cr_startup_lpc43xx-m0app.c **** #else
 407:../src/cr_startup_lpc43xx-m0app.c **** void M0_NMI_Handler(void)
 408:../src/cr_startup_lpc43xx-m0app.c **** #endif
 409:../src/cr_startup_lpc43xx-m0app.c **** {   while(1) { }
 298              		.loc 1 409 0
 299              		.cfi_startproc
 300 0074 80B5     		push	{r7, lr}
 301              		.cfi_def_cfa_offset 8
 302              		.cfi_offset 7, -8
 303              		.cfi_offset 14, -4
 304 0076 00AF     		add	r7, sp, #0
 305              		.cfi_def_cfa_register 7
 306              	.L16:
 307              		.loc 1 409 0 discriminator 1
 308 0078 FEE7     		b	.L16
