wowHollis/SmartCart/src/camera/pixy/misc/gcc/m0/Release/cr_startup_lpc43xx-m0app.asm
 309              		.cfi_endproc
 310              	.LFE35:
 312              		.section	.rodata
 313              		.align	2
 314              	.LC4:
 315 0000 48617264 		.ascii	"HardFault\012\000"
 315      4661756C 
 315      740A00
 316              		.section	.after_vectors
 317 007a C046     		.align	2
 318              		.weak	M0_HardFault_Handler
 319              		.code	16
 320              		.thumb_func
 322              	M0_HardFault_Handler:
 323              	.LFB36:
 410:../src/cr_startup_lpc43xx-m0app.c **** }
 411:../src/cr_startup_lpc43xx-m0app.c **** 
 412:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".after_vectors")))
 413:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
 414:../src/cr_startup_lpc43xx-m0app.c **** void HardFault_Handler(void)
 415:../src/cr_startup_lpc43xx-m0app.c **** #else
 416:../src/cr_startup_lpc43xx-m0app.c **** void M0_HardFault_Handler(void)
 417:../src/cr_startup_lpc43xx-m0app.c **** #endif
 418:../src/cr_startup_lpc43xx-m0app.c **** {
 324              		.loc 1 418 0
 325              		.cfi_startproc
 326 007c 80B5     		push	{r7, lr}
 327              		.cfi_def_cfa_offset 8
 328              		.cfi_offset 7, -8
 329              		.cfi_offset 14, -4
 330 007e 00AF     		add	r7, sp, #0
 331              		.cfi_def_cfa_register 7
 419:../src/cr_startup_lpc43xx-m0app.c **** 	_DBG("HardFault\n");
 332              		.loc 1 419 0
 333 0080 034B     		ldr	r3, .L19
 334 0082 044A     		ldr	r2, .L19+4
 335 0084 1900     		movs	r1, r3
 336 0086 1000     		movs	r0, r2
 337 0088 FFF7FEFF 		bl	UARTPuts
 338              	.L18:
 420:../src/cr_startup_lpc43xx-m0app.c **** 	while(1) { }
 339              		.loc 1 420 0 discriminator 1
 340 008c FEE7     		b	.L18
 341              	.L20:
 342 008e C046     		.align	2
 343              	.L19:
 344 0090 00000000 		.word	.LC4
 345 0094 00200840 		.word	1074274304
 346              		.cfi_endproc
 347              	.LFE36:
 349              		.align	2
 350              		.weak	M0_SVC_Handler
 351              		.code	16
 352              		.thumb_func
 354              	M0_SVC_Handler:
 355              	.LFB37:
 421:../src/cr_startup_lpc43xx-m0app.c **** }
 422:../src/cr_startup_lpc43xx-m0app.c **** 
 423:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".after_vectors")))
 424:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
 425:../src/cr_startup_lpc43xx-m0app.c **** void SVC_Handler(void)
 426:../src/cr_startup_lpc43xx-m0app.c **** #else
 427:../src/cr_startup_lpc43xx-m0app.c **** void M0_SVC_Handler(void)
 428:../src/cr_startup_lpc43xx-m0app.c **** #endif
 429:../src/cr_startup_lpc43xx-m0app.c **** {   while(1) { }
 356              		.loc 1 429 0
 357              		.cfi_startproc
 358 0098 80B5     		push	{r7, lr}
 359              		.cfi_def_cfa_offset 8
 360              		.cfi_offset 7, -8
 361              		.cfi_offset 14, -4
 362 009a 00AF     		add	r7, sp, #0
 363              		.cfi_def_cfa_register 7
 364              	.L22:
 365              		.loc 1 429 0 discriminator 1
 366 009c FEE7     		b	.L22
 367              		.cfi_endproc
 368              	.LFE37:
 370 009e C046     		.align	2
 371              		.weak	M0_PendSV_Handler
 372              		.code	16
 373              		.thumb_func
 375              	M0_PendSV_Handler:
 376              	.LFB38:
 430:../src/cr_startup_lpc43xx-m0app.c **** }
 431:../src/cr_startup_lpc43xx-m0app.c **** 
 432:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".after_vectors")))
 433:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
 434:../src/cr_startup_lpc43xx-m0app.c **** void PendSV_Handler(void)
 435:../src/cr_startup_lpc43xx-m0app.c **** #else
 436:../src/cr_startup_lpc43xx-m0app.c **** void M0_PendSV_Handler(void)
 437:../src/cr_startup_lpc43xx-m0app.c **** #endif
 438:../src/cr_startup_lpc43xx-m0app.c **** {   while(1) { }
 377              		.loc 1 438 0
 378              		.cfi_startproc
 379 00a0 80B5     		push	{r7, lr}
 380              		.cfi_def_cfa_offset 8
 381              		.cfi_offset 7, -8
 382              		.cfi_offset 14, -4
 383 00a2 00AF     		add	r7, sp, #0
 384              		.cfi_def_cfa_register 7
 385              	.L24:
 386              		.loc 1 438 0 discriminator 1
 387 00a4 FEE7     		b	.L24
 388              		.cfi_endproc
 389              	.LFE38:
 391 00a6 C046     		.align	2
 392              		.weak	M0_SysTick_Handler
 393              		.code	16
 394              		.thumb_func
 396              	M0_SysTick_Handler:
 397              	.LFB39:
 439:../src/cr_startup_lpc43xx-m0app.c **** }
 440:../src/cr_startup_lpc43xx-m0app.c **** 
 441:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".after_vectors")))
 442:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
 443:../src/cr_startup_lpc43xx-m0app.c **** void SysTick_Handler(void)
 444:../src/cr_startup_lpc43xx-m0app.c **** #else
 445:../src/cr_startup_lpc43xx-m0app.c **** void M0_SysTick_Handler(void)
 446:../src/cr_startup_lpc43xx-m0app.c **** #endif
 447:../src/cr_startup_lpc43xx-m0app.c **** {   while(1) { }
 398              		.loc 1 447 0
 399              		.cfi_startproc
 400 00a8 80B5     		push	{r7, lr}
 401              		.cfi_def_cfa_offset 8
 402              		.cfi_offset 7, -8
 403              		.cfi_offset 14, -4
 404 00aa 00AF     		add	r7, sp, #0
 405              		.cfi_def_cfa_register 7
 406              	.L26:
 407              		.loc 1 447 0 discriminator 1
 408 00ac FEE7     		b	.L26
 409              		.cfi_endproc
 410              	.LFE39:
 412 00ae C046     		.align	2
 413              		.weak	M0_IntDefaultHandler
 414              		.code	16
 415              		.thumb_func
 417              	M0_IntDefaultHandler:
 418              	.LFB40:
 448:../src/cr_startup_lpc43xx-m0app.c **** }
 449:../src/cr_startup_lpc43xx-m0app.c **** 
 450:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 451:../src/cr_startup_lpc43xx-m0app.c **** //
 452:../src/cr_startup_lpc43xx-m0app.c **** // Processor ends up here if an unexpected interrupt occurs or a specific
 453:../src/cr_startup_lpc43xx-m0app.c **** // handler is not present in the application code.
 454:../src/cr_startup_lpc43xx-m0app.c **** //
 455:../src/cr_startup_lpc43xx-m0app.c **** //*****************************************************************************
 456:../src/cr_startup_lpc43xx-m0app.c **** __attribute__ ((section(".after_vectors")))
 457:../src/cr_startup_lpc43xx-m0app.c **** #if defined (__USE_LPCOPEN)
 458:../src/cr_startup_lpc43xx-m0app.c **** void IntDefaultHandler(void)
 459:../src/cr_startup_lpc43xx-m0app.c **** #else
 460:../src/cr_startup_lpc43xx-m0app.c **** void M0_IntDefaultHandler(void)
 461:../src/cr_startup_lpc43xx-m0app.c **** #endif
 462:../src/cr_startup_lpc43xx-m0app.c **** {   while(1) { }
 419              		.loc 1 462 0
 420              		.cfi_startproc
 421 00b0 80B5     		push	{r7, lr}
 422              		.cfi_def_cfa_offset 8
 423              		.cfi_offset 7, -8
 424              		.cfi_offset 14, -4
 425 00b2 00AF     		add	r7, sp, #0
 426              		.cfi_def_cfa_register 7
 427              	.L28:
 428              		.loc 1 462 0 discriminator 1
 429 00b4 FEE7     		b	.L28
 430              		.cfi_endproc
 431              	.LFE40:
 433              		.weak	M0_M0SUB_IRQHandler
 434              		.thumb_set M0_M0SUB_IRQHandler,M0_IntDefaultHandler
 435              		.weak	M0_SPIFI_OR_VADC_IRQHandler
 436              		.thumb_set M0_SPIFI_OR_VADC_IRQHandler,M0_IntDefaultHandler
 437              		.weak	M0_C_CAN0_IRQHandler
 438              		.thumb_set M0_C_CAN0_IRQHandler,M0_IntDefaultHandler
 439              		.weak	M0_I2S0_OR_I2S1_OR_QEI_IRQHandler
 440              		.thumb_set M0_I2S0_OR_I2S1_OR_QEI_IRQHandler,M0_IntDefaultHandler
 441              		.weak	M0_USART3_IRQHandler
 442              		.thumb_set M0_USART3_IRQHandler,M0_IntDefaultHandler
 443              		.weak	M0_USART2_OR_C_CAN1_IRQHandler
 444              		.thumb_set M0_USART2_OR_C_CAN1_IRQHandler,M0_IntDefaultHandler
 445              		.weak	M0_USART0_IRQHandler
 446              		.thumb_set M0_USART0_IRQHandler,M0_IntDefaultHandler
 447              		.weak	M0_EVENTROUTER_IRQHandler
 448              		.thumb_set M0_EVENTROUTER_IRQHandler,M0_IntDefaultHandler
 449              		.weak	M0_SSP0_OR_SSP1_IRQHandler
 450              		.thumb_set M0_SSP0_OR_SSP1_IRQHandler,M0_IntDefaultHandler
 451              		.weak	M0_ADC1_IRQHandler
 452              		.thumb_set M0_ADC1_IRQHandler,M0_IntDefaultHandler
 453              		.weak	M0_SPI_OR_DAC_IRQHandler
 454              		.thumb_set M0_SPI_OR_DAC_IRQHandler,M0_IntDefaultHandler
 455              		.weak	M0_SGPIO_IRQHandler
 456              		.thumb_set M0_SGPIO_IRQHandler,M0_IntDefaultHandler
 457              		.weak	M0_I2C0_OR_I2C1_IRQHandler
 458              		.thumb_set M0_I2C0_OR_I2C1_IRQHandler,M0_IntDefaultHandler
 459              		.weak	M0_ADC0_IRQHandler
 460              		.thumb_set M0_ADC0_IRQHandler,M0_IntDefaultHandler
 461              		.weak	M0_MCPWM_IRQHandler
 462              		.thumb_set M0_MCPWM_IRQHandler,M0_IntDefaultHandler
 463              		.weak	M0_TIMER3_IRQHandler
 464              		.thumb_set M0_TIMER3_IRQHandler,M0_IntDefaultHandler
 465              		.weak	M0_GINT1_IRQHandler
 466              		.thumb_set M0_GINT1_IRQHandler,M0_IntDefaultHandler
 467              		.weak	M0_TIMER0_IRQHandler
 468              		.thumb_set M0_TIMER0_IRQHandler,M0_IntDefaultHandler
 469              		.weak	M0_RIT_OR_WWDT_IRQHandler
 470              		.thumb_set M0_RIT_OR_WWDT_IRQHandler,M0_IntDefaultHandler
 471              		.weak	M0_SCT_IRQHandler
 472              		.thumb_set M0_SCT_IRQHandler,M0_IntDefaultHandler
 473              		.weak	M0_USB1_IRQHandler
 474              		.thumb_set M0_USB1_IRQHandler,M0_IntDefaultHandler
 475              		.weak	M0_USB0_IRQHandler
 476              		.thumb_set M0_USB0_IRQHandler,M0_IntDefaultHandler
 477              		.weak	M0_LCD_IRQHandler
 478              		.thumb_set M0_LCD_IRQHandler,M0_IntDefaultHandler
 479              		.weak	M0_SDIO_IRQHandler
 480              		.thumb_set M0_SDIO_IRQHandler,M0_IntDefaultHandler
 481              		.weak	M0_ETH_IRQHandler
 482              		.thumb_set M0_ETH_IRQHandler,M0_IntDefaultHandler
 483              		.weak	M0_DMA_IRQHandler
 484              		.thumb_set M0_DMA_IRQHandler,M0_IntDefaultHandler
 485              		.weak	M0_M4CORE_IRQHandler
 486              		.thumb_set M0_M4CORE_IRQHandler,M0_IntDefaultHandler
 487              		.weak	M0_RTC_IRQHandler
 488              		.thumb_set M0_RTC_IRQHandler,M0_IntDefaultHandler
 489 00b6 C046     		.text
 490              	.Letext0:
 491              		.file 2 "/usr/local/lpcxpresso_8.1.4_606/lpcxpresso/tools/redlib/include/stdint.h"
 492              		.file 3 "/home/weyoui/PROJECTS/SmartCart/Pixy/pixy/misc/gcc/pixy_m0/inc/lpc43xx.h"
DEFINED SYMBOLS
                            *ABS*:00000000 cr_startup_lpc43xx-m0app.c
     /tmp/ccUnLH0K.s:24     .isr_vector:00000000 g_pfnVectors
     /tmp/ccUnLH0K.s:21     .isr_vector:00000000 $d
     /tmp/ccUnLH0K.s:192    .text.ResetISR:00000000 ResetISR
     /tmp/ccUnLH0K.s:296    .after_vectors:00000074 M0_NMI_Handler
     /tmp/ccUnLH0K.s:322    .after_vectors:0000007c M0_HardFault_Handler
     /tmp/ccUnLH0K.s:354    .after_vectors:00000098 M0_SVC_Handler
     /tmp/ccUnLH0K.s:375    .after_vectors:000000a0 M0_PendSV_Handler
     /tmp/ccUnLH0K.s:396    .after_vectors:000000a8 M0_SysTick_Handler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_RTC_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_M4CORE_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_DMA_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_ETH_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_SDIO_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_LCD_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_USB0_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_USB1_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_SCT_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_RIT_OR_WWDT_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_TIMER0_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_GINT1_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_TIMER3_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_MCPWM_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_ADC0_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_I2C0_OR_I2C1_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_SGPIO_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_SPI_OR_DAC_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_ADC1_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_SSP0_OR_SSP1_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_EVENTROUTER_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_USART0_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_USART2_OR_C_CAN1_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_USART3_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_I2S0_OR_I2S1_OR_QEI_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_C_CAN0_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_SPIFI_OR_VADC_IRQHandler
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_M0SUB_IRQHandler
     /tmp/ccUnLH0K.s:74     .after_vectors:00000000 $t
     /tmp/ccUnLH0K.s:79     .after_vectors:00000000 data_init
     /tmp/ccUnLH0K.s:139    .after_vectors:00000040 bss_init
     /tmp/ccUnLH0K.s:187    .text.ResetISR:00000000 $t
     /tmp/ccUnLH0K.s:282    .text.ResetISR:00000078 $d
     /tmp/ccUnLH0K.s:313    .rodata:00000000 $d
     /tmp/ccUnLH0K.s:344    .after_vectors:00000090 $d
     /tmp/ccUnLH0K.s:349    .after_vectors:00000098 $t
     /tmp/ccUnLH0K.s:417    .after_vectors:000000b0 M0_IntDefaultHandler
                     .debug_frame:00000010 $d

UNDEFINED SYMBOLS
_vStackTop
__main
__data_section_table
__data_section_table_end
__bss_section_table_end
UARTPuts
